# 1. Переменные (1 балл)
# Объявите переменную age и присвойте ей значение вашего возраста. Выведите значение переменной.

# 2. Типы данных (1 балл)
# Создайте список, включающий целые числа, строки и логические значения. Выведите тип данных для каждого элемента списка.

# 3. Методы строк, списков (1.5 балла)
# Создайте строку и список. Используя методы строк, преобразуйте строку в список символов. Затем объедините список и созданную ранее строку.

# 4. Встроенные функции (1.5 балла)
# Создайте список чисел. Используйте встроенные функции max, min, filter, чтобы найти максимальное и минимальное значения, а также отфильтровать только четные числа.

# 5. Приведение типов (1 балл)
# Используя функции приведения типов, создайте целочисленную переменную num из строки и вещественную переменную float_num из num. Произведите деление num на float_num и выведите результат.

# 6. Условные операторы (1 балл)
# Напишите программу, которая проверяет, является ли введенное число четным и положительным. Выведите соответствующее сообщение

# 7. Условные выражения (1 балл)
# Запросите у пользователя его возраст. Используя условные выражения, выведите сообщение о том, является ли он совершеннолетним.

# 8. Функции (1.5 балла)
# Напишите функцию, которая принимает на вход два аргумента (числа) и возвращает их сумму. Вызовите функцию с конкретными значениями и выведите результат.

# 9. Лямбда функции (2 балла)
# Используя лямбда функцию, создайте функцию, которая возвращает квадрат входного числа. Примените ее к списку чисел.

# 10. Словари (1 балл)
# - Создайте словарь с именами и возрастами нескольких людей. Выведите информацию о каждом человеке в формате "Имя: Возраст". Формат соблюдать

# 11. (2 балла)
# Напишите программу, которая принимает на вход строку и выводит количество уникальных символов в ней, игнорируя регистр.

# 12. (2 балла)
# - Создайте список чисел. Используя словарь и цикл, создайте новый словарь, где ключи - числа, а значения - их квадраты.

# 13. Итерации (1.5 балла)
# Напишите программу, которая принимает на вход число и выводит таблицу умножения для этого числа от 1 до 10.

# 14. Обработка ошибок (1 балл)
# Напишите программу, которая запрашивает у пользователя ввод числа. Если введенные данные не являются числом, обработайте ошибку и выведите соответствующее сообщение.

# 15. Работа со строками (1.5 балла)
# Создайте две строки. Сравните их длины и выведите результат сравнения. Затем объедините строки и выведите новую длину.
